ArimotoHikaru/stm32f4_project/stm32f4_2LayerBoard/main.h
/**
  ******************************************************************************
  * @file    Demonstrations/Inc/main.h 
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    26-June-2014
  * @brief   Header for main.c module
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#define DEBUG_1
#define DEBUG_2
#define DEBUG_3

//#define USE_MICROUSB

//#define USE_USART1
//#define USE_INTERRUPT_USART1

//#define USE_USART2
//#define USE_INTERRUPT_USART2

#define USE_USART3
#define USE_INTERRUPT_USART3

//#define USE_I2C1
//#define USE_INTERRUPT_I2C1

//#define USE_SPI
//#define USE_INTERRUPT_SPI

//#define USE_ENCODER
//#define USE_INTERRUPT_TIM4
//#define USE_INTERRUPT_TIM5
//#define USE_INTERRUPT_TIM8_13

//#define USE_ADC

//#define USE_SDIO

#define USE_CAN
#define USE_INTERRUPT_CAN_RX
//#define USE_INTERRUPT_CAN_TX

//#define USE_PWM

//#define USE_EXTI

enum {
  I2C_STATE_START = 0,
  I2C_STATE_ADDRESS_DONE,
  I2C_STATE_DATA_1_DONE,
  I2C_STATE_DATA_2_DONE,
  I2C_STATE_STOP,
} MASTER_SEND_STATE;

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_conf.h"
#include "stm32f4xx.h"
#include "stm32f4xx_it.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_exti.h"
#include "usbd_cdc_core.h"
#include "usbd_usr.h"
#include "usbd_desc.h"
#include "usbd_cdc_vcp.h"
#include "usb_dcd_int.h"
#include "stm32f4xx_tim.h"
#include "stm32f4xx_sdio.h"
#include "stm32f4xx_spi.h"
#include "stm32f4xx_exti.h"
#include "stm32f4_discovery.h"
#include "stm32f4xx_i2c.h"
#include "stm32f4xx_can.h"

/* user_hedder --------------------------------------------------------------*/
#include "adc.h"
#include "tim_pwm.h"
#include "usart.h"
#include "tim_encoder.h"
#include "stm32_ub_fatfs.h"
#include "can.h"



//マイクロusbで必要
/*
 * The USB data must be 4 byte aligned if DMA is enabled. This macro handles
 * the alignment, if necessary (it's actually magic, but don't tell anyone).
 */
__ALIGN_BEGIN USB_OTG_CORE_HANDLE  USB_OTG_dev __ALIGN_END;


#define CAN_NodeId_Dualshock3	0x003	//0x00~0x1F
#define CAN_NodeId_STM32F4_1	0x0F

//Dualshock3のデータ解析用
//この列挙型の値はArduino側の設定と合わせる
enum {
	start = 'a',
	select,
	left_x,
	left_y,
	right_x,
	right_y,
	L1,L2,
	R1,R2,
	Triangle,
	Circle,
	Cross,
	Square,
	Up,
	Right,
	Down,
	Left,
	CError
}Mnemonic;

typedef struct _Button{
	uint8_t	value;
}Button;

typedef struct _DualshockBotton{
	Button	start,
			select,
			left_x,
			left_y,
			right_x,
			right_y,
			L1,
			L2,
			R1,
			R2,
			Triangle,
			Circle,
			Cross,
			Square,
			Up,
			Right,
			Down,
			Left,
			CError;
}DualshockBotton;




/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
void init();
void ColorfulRingOfDeath(void);

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
